Revit 2027 API
BuiltInFailures.SystemsFailures.FamilyDoesntMatchSystemProperties Property
 The family no longer matches the properties for the System. Disconnect the family from the System?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyDoesntMatchSystemProperties { get; }
Public Shared ReadOnly Property FamilyDoesntMatchSystemProperties As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyDoesntMatchSystemProperties {
	FailureDefinitionId^ get ();
}
static member FamilyDoesntMatchSystemProperties : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SystemsFailures Class
Autodesk.Revit.DB Namespace